InformationRegisters/дп_ПринтерыМакетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>дп_ПринтерыМакетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Принтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.дп_Принтеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолеСверху</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолеСнизу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолеСправа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолеСлева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиринаСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Макет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НазначенияШаблоновЭтикетокИЦенников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>НазначенияШаблоновЭтикетокИЦенников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаДляТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенникДляТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаДляСкладскихЯчеек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаДляДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаСерииНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаУпаковочныхЛистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтикеткаДляАкцизныхМарок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/дп_ПринтерыМакетов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Запись.Пользователь) Тогда
	
		Запись.Пользователь = Пользователи.ТекущийПользователь();
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ШаблонЭтикетки) Тогда
		Если Запись.ШаблонЭтикетки.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров Тогда
			Запись.Макет = "Этикетка: "+Запись.ШаблонЭтикетки.ПолноеНаименование();	
		Иначе
			Запись.Макет = Запись.ШаблонЭтикетки.ПолноеНаименование();
		КонецЕсли;
		
		Элементы.ШаблонЭтикетки.Доступность = Ложь;
		Элементы.Макет.Доступность = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура МакетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПолноеСтроковоеИмяТипа = "";
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТипОбъектаСтрокой", ПолноеСтроковоеИмяТипа);
	
	ФильтрПоСсылочнымМетаданным = Новый СписокЗначений;
	ФильтрПоСсылочнымМетаданным.Добавить("Документы");
	СтруктураПараметров.Вставить("КоллекцииВыбираемыхОбъектовМетаданных", ФильтрПоСсылочнымМетаданным);
	
	ФормаВыбораОбъектаМетаДанных = ПолучитьФорму("РегистрСведений.дп_ПринтерыМакетов.Форма.ВыборОбъектаМетаданных",
	СтруктураПараметров,
	ЭтаФорма);
	
	ФормаВыбораОбъектаМетаДанных.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаВыбораОбъектаМетаДанных.ЗакрыватьПриВыборе = Истина;
	
	//Если ИспользоватьРежимМодальности() Тогда
		// Стандартно в модальном режиме (8.2/8.3).
		ВыбранныйОбъектМетаДанных = ФормаВыбораОбъектаМетаДанных.ОткрытьМодально();
		//ВызватьВыборОбъектаБД(ВыбранныйОбъектМетаДанных, Элемент);
	//Иначе
	//	// Стандартно в немодальном режиме (8.3).
	//	Выполнить("ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения(""ВызватьВыборОбъектаБД"", ЭтотОбъект, Элемент)");
	//	Выполнить("ФормаВыбораОбъектаМетаДанных.ОписаниеОповещенияОЗакрытии = ОписаниеОповещенияОЗакрытии");
	//	ФормаВыбораОбъектаМетаДанных.Открыть();
	//КонецЕсли;
	
	КоллекцияПечатныхФорм = ПолучитьКомплектПечатныхФорм(ВыбранныйОбъектМетаДанных);
	ДанныеВыбора = Новый СписокЗначений;	
	Для Каждого СтрокаПечатнаяФорма из КоллекцияПечатныхФорм Цикл
		 ДанныеВыбора.Добавить(СтрокаПечатнаяФорма.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКомплектПечатныхФорм(ВыбранныйОбъектМетаДанных)

	Возврат РегистрыСведений.НастройкиПечатиОбъектов.КомплектПечатныхФорм(
		ВыбранныйОбъектМетаДанных,
		Неопределено,
		0)

КонецФункции // ()
